# todo: Определить в коде переменные:
int_num = 5 # 1. Целочисленного типа
float_num = 3.14 # 2. Вещественного типа
is_raining = True # 3. Логического типа
my_string = "Hello, world!" # 4. Строкового типа
var = None # 5. Пустого типа
print(type(int_num), type(float_num), type(is_raining), type(my_string),
                                                             type(var)) #
# Вывести их типы.